import 'package:flutter/material.dart';
import 'package:carousel_slider/carousel_slider.dart';

class Data {
  Data(
      {@required this.img,
      @required this.title,
      @required this.body,
      @required this.url,
      this.id});
  final String img;
  final String title;
  final String body;
  final String url;
  final String id;
}

var countries = [
  Data(
      img:
          'https://lh3.googleusercontent.com/yWHANwp_jFyWSV-xwRIKLD_pguxnL4VSDmkvePkboqP33eAzrBn1en0W_RAcKFMA7uf9TEhMyQ=w640-h400-e365-rj-sc0x00ffffff',
      title: 'سيدني',
      body:
          'سدني المدينة الاسترالية العظيمة ، المدينة ذات السحر الخاص ، المدينة التي صنفت من أفضل خمس مدن بالعالم للعيش بها ! .. مدينة الميناء والشواطئ والطعام اللذيذ الذي ربما لن تتذوق مثله بالعالم !.. مدينة مليئة بالمنتزهات والحدائق التي ستنزيل عن كاهلك هموم الحياة ',
      url: null,
      id: '11'),
  Data(
      img:
          'https://wallpaperaccess.com/full/3984740.jpg?fbclid=IwAR0Rsyilss-jCKrqYJkwORDuEKWFiO6a8HQEBs9kEnRgAOmFpdRvSVEyqQw',
      title: 'ميلبورن',
      body:
          'حصلت هذه المدينة العظيمة على لقب أفضل مدينة في العالم لمدة خمس سنوات على التوالي،تضم المدينة الكثير من المطاعم والطهاة،كما تعتبر مركزا لمحبي شرب القهوة ولذلك تسمى عاصمة جنون القهوة في استراليا ! .. تحتوي هذه المدينة التي تشتهر بتنظيمها الكبير على شبكة ضخمة  من المواصلات العامة ، كما انها تمتلك اسواق تسوق في الهواء الطلق! ',
      url: null,
      id: '12'),
  Data(
      img: 'https://wallpaperaccess.com/full/1605246.jpg',
      title: 'بريسبان',
      body:
          'حصلت هذه المدينة العظيمة على لقب أفضل مدينة في العالم لمدة خمس سنوات على التوالي،تضم المدينة الكثير من المطاعم والطهاة،كما تعتبر مركزا لمحبي شرب القهوة ولذلك تسمى عاصمة جنون القهوة في استراليا ! .. تحتوي هذه المدينة التي تشتهر بتنظيمها الكبير على شبكة ضخمة  من المواصلات العامة ، كما انها تمتلك اسواق تسوق في الهواء الطلق! ',
      url: null,
      id: '13'),
  Data(
      img: 'https://wallpaperaccess.com/full/3113346.jpg',
      title: 'بيرث',
      body:
          'هل تحلم بالعيش في أجواء أستراليا المشمسة والمعتدلة؟ إذا كن مطمئناً لدى اختيار مدينة بيرث الكثير من النشاطات في بيرث من المطاعم اللذيذة والأنيقة إلى متاجر الملابس المصممة محلياً ووصولاً إلى الأسواق المفتوحة وأماكن السهر، تقدم بيرث ما يرضي جميع الأذواق. لن تشعر بالملل في هذه المدينة. تبحث عن خيارات سياحية أخرى؟ جرب زيارة حديقة الحيوان، أو اركب القطار لنصف ساعة لمدينة فريمانتل الساحلية الساحرة ذات التاريخ البحري الثري',
      url: null,
      id: '14')
];

var syd = [
  Data(
    img:
        'https://wallpaperaccess.com/full/1655718.jpg?fbclid=IwAR3GpCBa8_W7SzJGnBudoi_2MurPnlZdODwecZBKUp7fXulDbW9TuS52lto',
    title: 'الحدائق النباتية الملكية ',
    body:
        'رؤية الزهور والورود والنباتات ذات الالوان العديدة والروائح الزاهية .. تبعث بالروح احساس بالسعادة والفرح والراحة ، الابتعاد عن صخب المباني ورؤية الطبيبعة امر نحتاجه من حين لآخر لننسى القليل من الهموم المتراكمة على قلوبنا ! .. ولا يمكن أن تجد عزيزي السائح مكاناً أفضل من الحدائق الملكية لهذا ! .. ف هي تحتوي على اكثر من 7500نوع من النبات!  تمثل معنى العراقة الحقيقي .. حيث تم افتتاح هذه الحدائق عام 1816 .. حتى أصبحت في يومنا هذا من أهم المعالم السياحية الاسترالية .. ومن أهم المعالم لترويح عن النفس .. ',
    url: 'https://www.rbgsyd.nsw.gov.au/',
  ),
  Data(
    img:
        'https://www.urtrips.com/wp-content/uploads/2017/08/Sydney-Tower-ObservationDeck-768x576.jpg',
    title: 'برج سيدني ',
    body:
        'اذا كنت من هواة الاطلالات الجذابة والعالية .. اهلا بك في يرج سدني .. حيث يمكنك رؤية المدينة بأكملها ! وما رأيك بالتقاط الصور الجذابة لهذا المنظر المهيب .. ويمكن كذلك تجربة المطاعم ذات الطعام المعد على يد أمهر الطهاة في العالم وأنت في هذه الاطلالة الرائعة !  وإن كنت لا تخشى المرتفعات عزيزي ، فيمكنك الاشتراك في جولة سيرًا على الأقدام برفقة مرشدين مختصين، 268 متر فوق مستوى الأرض. هذه المغامرة ستمنحك فرصة رؤية المدينة دون حواجز، سيرًا على الزجاج، لكن تذكر أن ترتدي حذاءً رياضيًا مريحًا، وانتبه للرياح العاتية التي ستواجهك!',
    url: null,
  ),
  Data(
    img:
        'https://wallpaperaccess.com/full/1564393.jpg?fbclid=IwAR3sYFK-HTX6KhG5xfA8F7iA4HLRravCurmrp_anBQvi2JqA4MEt-5MfZo0',
    title: 'دار الأوبرا في سيدني',
    body:
        'أهلا بك في أهم معالم الجذب السياحي في سيدني !  تم بناء هذا المعلم الجذاب في عام 1974 وما زال في أزهى وأبهى حالاته ليومنا هذا ! أهلا بك للاستممتاع بأفضل مسارح الأوبرا في العالم!',
    url: null,
  ),
  Data(
    img:
        'https://int.sydney.com/sites/international/files/styles/header_slider/public/2016-12/Darling%20Harbour%20-%20DNSW.jpg?itok=tdP11_Ud&fbclid=IwAR3fspQitsJ6fMxM_FZcxDauBOw2qN4l-oBMJnLPm6c-bLyb1sG_fSosOFw',
    title: 'دار لينج هاربور',
    body:
        'هل من الممكن أنك في استراليا .. دون أن تزور واح من أضخم مراكز التسوق والترفيه من هذه القارة العجيبة ؟هي أحدي المناطق الكبيرة المخصصه للتسوق والترفية ، تقع في وسط مدينة سيدني وتحتوي العديد من أشهر المطاعم العالميه والمحليه والمتاحف والمحلات الخاصه بالتسوق والعديد من الأماكن التي تستحق الزيارة ، تستطيع هناك زيارة المتحف الوطني الأسترالي البحري وحوض اسماك سيدني والحياة البرية في سيدني ،ثم يمكنك شراء المثلجات وشرب القهوة وتناول الطعام في العديد من المطاعم المتوفره في هذه المنطقه!',
    url: null,
  ),
  Data(
    img:
        'https://i.pinimg.com/originals/83/b6/f5/83b6f55e68a63de395dc9aedda74914f.jpg?fbclid=IwAR2gV2uTYboPjUvN46CUt4hwc8rfgNMAcoetGw8ydChThrVZlrS1_H-D_J0',
    title: 'جسر ميناء سيدني ',
    body:
        'الهيكل الأكثر اثارة في سيدني ! يمكنك القيام بجولة سيرًا على الأقدام في ممر المشاة لالتقاط أجمل الصور للجسر، والمدينة، وبشكلٍ خاص دار الأوبرا الأسترالية الشهيرة! وإن كنت من محبي ركوب الدراجة، فيوجد ممر خاص بالدراجات على الجسر، حيث يمكنك أيضًا رؤية مشاهد خلابة لمدينة سيدني ولمحبي المغامرة، يمكنكم تسلق الجسر والاستمتاع بمشاهدة أجمل المشاهد البانورامية للمدينة من ارتفاع 134 متر  وتعتبر الرحلات البحرية المسائية من أجمل أنشطة الجسر، حيث يمكنك مشاهدة الجسر ودار الأوبرا الأسترالية بأجمل الإضاءات، خصوصًا في المناسبات',
    url: null,
  ),
  Data(
    img:
        'https://wallpaperaccess.com/full/1117655.jpg?fbclid=IwAR3ZQZsukElMC4kkDWWI9Qs2aiRI5eaqS7-zV1VL-mLBxXaEBXgQo0jQOZU',
    title: 'حديقة حيوان تارونجا سيدني:',
    body:
        'بدايةً يمكنك الاستمتاع برحلة بحرية مدتها ربع ساعة للوصول إلى الحديقة حتى تتفادى زحام السيارات، حيث تغادر عبّارة كل نصف ساعة من من ميناء سيركيولار كواي باتجاه الحديقة ثم يمكنك ركوب الجندول أو التلفريك من رصيف العبارة إلى المدخل الرئيسي للحديقة، وخلال رحلتك ستستمع بمناظر رائعة لأفق المدينة، والجسر، ودار الأوبرا  ثم عند وصولك إلى الحديقة، يمكنك التجول في أرجاء المكان ومشاهدة العديد من الحيوانات من شتى الأنواع مثل، الزرافات والقرود والكوالا وغيرها  وننصحك بتخصيص يومٍ كامل للحديقة للاستمتاع بكل مرافقها، ويُفضل ألا يكون خلال العطلة الأسبوعية التي تكون مكتظة جدًا بالزوار ',
    url: null,
  ),
  Data(
    img:
        'https://wallpaperaccess.com/full/1737653.jpg?fbclid=IwAR0ZNsB3US7filJiJ5mRIUMU5xRJkPP_Sj7xtvzQQCZIGHDxakARmSNU0w4',
    title: 'اكواريوم سيدني للحياة البحرية',
    body:
        'يعد من أهم الأماكن السياحية في استراليا بسبب التنوع الكبير في الحياة البحرية فيه،يضم الحوض 14 قسمًا يمثل كلٌ منها فكرة مستقلة عن الأخرى تتناسب مع ما يحتويه من مخلوقات مثل البحار الجوراسية، وحطام سفينة الساحل الجنوبي، وممشى سمك القرش، إلى جانب أكبر عرض للحاجز المرجاني العظيم في العالم،كما يمكن لأطفالك الاستمتاع بزيارة الخليج الاستوائي وحوض الأحجار الاستكشافي، حيث تتاح لهم الفرصة لمداعبة قنافذ، ونجم البحر، وخيار البحر، وغيرها.• ولا بد لكم من زيارة جزيرة دوغونغ، حيث يتواجد بقر البحر المهدد بالإنقراض، وخنزير البحر، ومجموعة أخرى من الحيوانات المدهشة.',
    url: null,
  ),
];

var mel = [
  Data(
    img:
        'https://www.travellwd.com/wp-content/uploads/2019/09/%D8%B3%D8%A7%D8%AD%D8%A9-%D8%A7%D9%84%D8%A3%D8%AA%D8%AD%D8%A7%D8%AF-700x467.jpg',
    title: 'ساحة الأتحاد',
    body:
        'تعد الساحة جزء لا يتجزء من المدينة فهو من أبرز معالمها الرئيسية و مكان رائع للسياح لبدء مشاهدة المعالم السياحية فى المدينة الساحة مصممة بطريقة حديثة حيث المساحات المفتوحة والمغلقة والمرتبطة مع المبانى المعمارية الفيكتورية الرائعة و تضم الساحة معرض إيان المخصص للفن الاسترالى ومركز للصور المتحركة و يجذب المكان العديد من السياح الذين يستمتعون بقضاء الوقت فى الهواء الطلق.سًميت الساحة بهذا الاسم لأنها كانت مركزاً للمؤيدين للجيش الاتحادي في الحرب الأهلية الأمريكية. تعتبر ساحة الاتحاد من المعالم التاريخية لولاية كاليفورنيا.',
    url: null,
  ),
  Data(
    img:
        'https://www.travellwd.com/wp-content/uploads/2019/09/%D9%85%D9%84%D8%B9%D8%A8-%D9%85%D9%84%D8%A8%D9%88%D8%B1%D9%86-%D9%84%D9%84%D9%83%D8%B1%D9%8A%D9%83%D9%8A%D8%AA-700x465.jpg',
    title: 'ملعب ملبورن للكريكت',
    body:
        'تم بناءة فى عام 1854 وغالبآ ما يتم أستخدامة لمباريات الكريكت حيث يعد الملعب الرسمى الذى يخوض فية نادى ملبورن للكريكت مبارياتة يتسع الملعب لجلوس 100ألف متفرج ويعد الملعب واحد من أعظم الملاعب فى العالم كما أنة كان الأستاد الرئيسى لدورة الألعاب الأولمبية عام 1956 ويضم الملعب المعرض الأسترالى للرياضة والمتحف الأولمبى يمكن للسياح الإستمتاع فية بمشاهدة مباريات الكركيت الرائعة.،',
    url: null,
  ),
  Data(
    img:
        'https://www.travellwd.com/wp-content/uploads/2019/09/%D8%B3%D8%A7%D9%88%D8%AB-%D8%A8%D8%A7%D9%86%D9%83-%D9%88%D9%85%D8%B1%D9%83%D8%B2-%D8%A7%D9%84%D9%81%D9%86%D9%88%D9%86-%D9%85%D9%84%D8%A8%D9%88%D8%B1%D9%86.jpg',
    title: 'ساوث بانك ومركز الفنون ملبورن',
    body:
        'قع على ضفاف نهر يارا على بعد مسافة قصيرة من محطة شارع فليندرز ويعد المكان نقطة جذب ثقافية غنية للزوار حيث يحتوى على أماكن للتنزة مغلقة ويوجد بة العديد من المطاعم والمقاهى الراقية فى الهواء الطلق والمركز هو أيضآ موطن لكثير من المهرجانات على مدار العام يضم المركز مجموعة من المسارح والأماكن بما فى ذلك مسرح للدولة ومسرح فيرفاكس التى تقدم العديد من العروضات الرائعة. ',
    url: null,
  ),
  Data(
    img:
        'https://www.travellwd.com/wp-content/uploads/2019/09/%D9%85%D8%AA%D8%AD%D9%81-%D9%81%D9%83%D8%AA%D9%88%D8%B1%D9%8A%D8%A7-%D9%88%D8%A3%D9%84%D8%A8%D8%B1%D8%AA-700x399.jpg',
    title: 'المتحف الوطنى فى فيكتوريا',
    body:
        'يعد المتحف أقدم معرض للفن العام فى أستراليا حيث يحمل معرض فيكتوريا الوطنى أكثر من 68,000 عمل فنى وقد تم أفتتاحة عام 1968 وتم تجديدة على نطاق واسع فى عام 2003 يتميز سقف المتحف بالزجاج الملون الزاهى ويعطى المتحف نظرة ثاقبة عن تاريخ الفن الأسترالى على مر السنين.،يقع متحف ملبورن في حدائق كارلتون ،',
    url: null,
  ),
  Data(
    img:
        'https://www.travellwd.com/wp-content/uploads/2019/09/%D8%A8%D8%B1%D8%AC-%D9%8A%D9%88%D8%B1%D9%8A%D9%83%D8%A7-667x500.jpeg',
    title: 'برج يوريكا',
    body:
        'كان البرج أطول مبنى سكنى فى العالم حيث يصل أرتفاعة إلى 297 متر وبدأ بناؤة عام 2002 وتم الأنتهاء منة عام 2006 ويتجاوز أرتفاعة برج هايتس فى دبى كانت المنطقة التى بنى فيها البرج تسمى قديمآ حاجز يوريكا حيث تدفق فيها الذهب الفيكتورى منذ عام 1854 وتم إبراز ذلك فى تصميمات البرج حيث وضع لة المصممين تيجان من الذهب اللامع مع شريط أحمر يمثل الدماء التى سالت أثناء الثورة ويتكون البرج من 91 طابق وكان أعلى برج فى العالم حين تم بناؤة ولكنة الأن يعد أعلى نقطة فى ملبورن ويحتل الأن المرتبة 108 من حيث المبانى الشاهقة الأرتفاع ويستخدم للسكن والشركات ولمراقبة السفن.',
    url: null,
  ),
  Data(
    img:
        'https://www.travellwd.com/wp-content/uploads/2019/09/%D8%B4%D8%A7%D8%B1%D8%B9-%D9%83%D9%88%D9%84%D9%8A%D9%86%D8%B2-670x500.jpg',
    title: 'شارع كولينز',
    body:
        'شارع كولينز هو شارع رئيسي في وسط ملبورن ، فيكتوريا في أستراليا. تم وضعه في المسح الأول لميلبورن ، وأصبح العنوان الأكثر زيارة في المدينة، وهو عبارة عن مجموعة من متاهات الشوارع الأنيقة والحارات والأزقة حول فلندرز تشكل كتلة رائعة من الممرات فى شارع كولينز، تتميز بأرضيتها المصنوعة من الفيفساء والمحلات التاريخية الفريدة التى ترجع إلى أواخر طبقة النبلاء فى القرن 19 تحتوى المنطقة على العديد من المقاهى التقليدية وتعد الممرات من أقدم الأماكن فى ملبورن التى تستحق الأستكشاف حيث هناك العديد من الجولات التى تنظمها الشركات مصحوبة بمرشيدين يشروحون فيها تاريخ الممرات والأزقة.  ',
    url: null,
  ),
  Data(
    img:
        'https://www.travellwd.com/wp-content/uploads/2019/09/%D9%85%D8%AA%D8%AD%D9%81-%D9%85%D9%84%D8%A8%D9%88%D8%B1%D9%86-700x467.jpg',
    title: 'متحف ملبورن ومبنى المعارض الملكى',
    body:
        'المبنى الملكي للمعارض هو عبارة عن مبنى مدرج في قائمة مواقع التراث العالمي في ملبورن ، أستراليا ، تم الانتهاء منه في 1 أكتوبر 1880 ، في 18 شهرًا فقط ،      لاستضافة معرض ملبورن الدولى ومازال المبنى إإلى الأن يستخدم للمعارض والمناسبات الخاصة،يقع فى شارع نيكلسون كارلتون ويضم المتحف مجموعة متنوعة من صور للمجتمع والثقافات الموجودة فية ومتحف للأطفال الذى يقدم سلسلة من الأنشطة التدريبية العملية التى تهدف إلى تحفيز وإشراك الأطفال ويحوى المتحف بناء للمعارض الملكى . ',
    url: null,
  ),
];

var bre = [
  Data(
    img: 'https://i.pinimg.com/originals/58/52/c0/5852c042f62b672c5904e79d4bcec5c5.jpg',
    title: 'محمية لون باين كوالا ',
    body:
        'إلى جانب الكوالا تعيش الحيوانات الأسترالية الأخرى مثل الكنغر والأمباط والطيور والثعابين وحتى التماسيح في هذا الملاذ الصغير الواقع على نهر بريسبان، ويمكن للزوار الاستمتاع بالفعاليات اليومية وعروض الحيوانات، ويوجد في المحمية متجر يبيع الحيوانات الأليفة.',
    url: null,
  ),
  Data(
    img: 'https://wallpaperaccess.com/full/1806430.jpg',
    title: 'المنطقة الثقافية ',
    body:
        'تعتبر المنطقة الثقافية الواقعة على ضفاف نهر بريسبان المدرجة في قائمة التراث وجهة رائعة لقضاء يوم في الخارج، حيث تضم مجموعة من المتاحف والمعارض الممتازة والحدائق، وتضيف الهندسة المعمارية الحائزة على الجوائز للمنطقة طابع عصري أنيق، وتشمل أبرز معالم الجذب هنا مكتبة ولاية كوينزلاند ومتحف كوينزلاند ومعارض مركز العلوم التفاعلية ومعرض الفن الحديث بالإضافة إلى مركز كوينزلاند للفنون الأدائية الذي يقدم عروضًا عالمية للأوبرا والباليه والعروض الكوميدية والحفلات الموسيقية المعاصرة.',
    url: null,
  ),
  Data(
    img:
        'https://wallpaperaccess.com/full/1806430.jpg',
    title: 'حدائق بريسان النباتية جبل كوت ثا ',
    body:
        'تطل حدائق بريسبان النباتية جبل كوت ثا على مناظر بانورامية للمدينة، وهي تقع على بعد 7 كيلومترات من المدينة، وتغطي 128 فدانًا من البساتين والحدائق المتنوعة مثل  الحدائق اليابانية، وأكبر مجموعة من أشجار الغابات المطيرة الأسترالية في العالم، بالإضافة إلى أقسام مخصصة للنباتات العطرية والخيزران والصبار والنباتات المحلية.',
    url: null,
  ),
  Data(
    img:
        'https://r4.wallpaperflare.com/wallpaper/918/282/517/art-artwork-gallery-museum-wallpaper-preview.jpg',
    title: 'معرض كوينزلاند للفنون ومعرض الفن الحديث ',
    body:
        'يحتل هذا المعرض مبنيين متجاورين ولكن متناقضين على طول الواجهة البحرية في منطقة الضفة الجنوبية الثقافية، وتشمل مجموعة المعرض أكثر من 1700 عمل فني من جميع أنحاء العالم، مع التركيز بشكل خاص على أستراليا والمحيط الهادئ وآسيا، ويقع معرض الفن الحديث في مبنى حديث مغطى بالزجاج، وتشمل المعروضات في هذا المعرض جميع الاعمال الفنية بما في ذلك النحت والرسم والفيديو والأفلام والتصوير الفوتوغرافي، فيما يركز معرض كوينزلاند للفنون على المجموعة الدولية والآسيوية وأعمال السكان الأصليين الأستراليين والمنحوتات الدرامية.',
    url: null,
  ),
  Data(
    img: 'https://vistapointe.net/images/brisbane-1.jpg',
    title: 'الضفة الجنوبية ',
    body:
        'كانت الضفة الجنوبية موقع معرض أكسبو العالمي 1988، وتعتبر عجلة بريسبان رمزًا لهذه المنطقة، وقد افتتحت هذه العجلة عام 2008 للاحتفال بالذكرى الـ150 لولاية كوينزلاند، وهي توفر رحلة مثيرة تستغرق من 10 إلى 12 دقيقة مع إطلالة استثنائية على النهر والمدينة، وتتزين المنطقة بأكملها بالحدائق والساحات والمتنزهات فضلاً عن مجموعة متنوعة من المطاعم، وتقدم الضفة الجنوبية للزوار الكثير من الأنشطة التي يمكنهم القيام بها مثل السباحة في البحيرة الاصطناعية، والمشاركة في تمارين اللياقة المجانية، وركوب الدراجات أو التنزه على طول الممرات.',
    url: null,
  ),
  Data(
    img: 'https://i.pinimg.com/236x/9e/13/c4/9e13c4e5821d2e300618d41b611eda40.jpg',
    title: 'رحلات النهر ',
    body:
        'الطريقة الأكثر إثارة لاستكشاف بريسبان هي عن طريق الرحلات النهرية سيتي كات، وتعمل هذه الرحلات على مدار الأسبوع، وتنطلق من جامعة كوينزلاند إلى الشاطئ الشمالي، مرورًا بالمواقع الصناعية المطورة والجسور والحدائق.',
    url: null,
  ),
  Data(
    img: 'https://www.visitbrisbane.com.au/~/media/brisbane-marketing/products/atdw/2019/07/24/02/44/queen-street-mall-5d34ed02a4b9b65e1744352b-16x9.ashx',
    title: 'كوين ستريت مول ',
    body:
        'مركز كوين ستريت للتسوق النابض بالحياة موطنًا لأكثر من 700 تاجر تجزئة يعرضون التصميمات والعلامات المحلية والوطنية والدولية، بالإضافة إلى واجهة الشارع المركزية المخصصة للمشاة، وقد تم إدراج هذه المتاهة من الأروقة في قائمة التراث، وفي يوم الاربعاء تتحول المنطقة الواقعة عند طرف جسر المركز التجاري إلى سوق المزارعين الصاخب الذي يبيع المنتجات المحلية والزهور والمنتجات الحرفية.',
    url: null,
  ),
  Data(
    img: 'https://artravelers.com/tourism/media/images/17/11/26/c46ba4e36d.jpg',
    title: 'متحف بريسان ',
    body:
        'يقع هذا المتحف المثير للإعجاب في أحد المباني التراثية الرائدة في بريسبان أعلى قاعة المدينة، وتم إعادة تطوير هذا المتحف المثير للاهتمام وإعادة افتتاحه في عام 2013، وهو يسلط الضوء على تاريخ بريسبان وشعبها والحياة اليومية من خلال سلسلة من المعارض الحديثة.',
    url: null,
  ),
];

var berth = [
  Data(
    img: 'https://images.squarespace-cdn.com/content/v1/58c1bae66a4963a1d42940bf/1583517169315-JJ8OQUM614F022P87U57/ke17ZwdGBToddI8pDm48kJuTH1IEMnRA384cQQhnt31Zw-zPPgdn4jUwVcJE1ZvWQUxwkmyExglNqGp0IvTJZamWLI2zvYWH8K3-s_4yszcp2ryTI0HqTOaaUohrI8PI4Pp2zk_a-9Vp83C8c9j6pFYmFx95A5LGBxNfiVubCyMKMshLAGzx4R3EDFOm1kBS/Perth+Bell+Tower.jpg',
    title: 'برج سوان بيل تاور',
    body:
        'يعد هذا البرج من اشهر مزارات و معالم السياحة في بيرث حيث يتميز بتصميمه المعماري الرائع فهو يضم 18 جرسا و يتم تشغيلها 4 ايام بالاسبوع و يقع بالقرب من نهر سوان كما انه يوفر اطلالات مميزة علي العديد من الاماكن المحيطة به فيبلغه طوله حوالي 82.5 متر',
    url: null,
  ),
  Data(
    img: 'https://arab-trip.com/wp-content/uploads/2019/07/unnamed-file-18111.jpg',
    title: 'نهر سوان',
    body:
        'يعد هذا النهر من اشهر معالم السياحة في بيرث حيث يستقطبه اعداد كبيرة من السياح للتنزه به و القيام بالجولات التنزه المائيه الجميلة',
    url: null,
  ),
  Data(
    img: 'https://museum.wa.gov.au/sites/default/files/imagecache/wam_v2_article_full/att-images/2012/perth-museum.jpeg',
    title: 'متحف غرب استراليا ',
    body:
        'يستقطب هذا المتحف اعداد كبيرة من السياح للتمتع و رؤية العديد من الديناصورات المحنطة  التي ترجع الي العصر الفيكتوري الي جانب العديد من الحيوانات الاخري',
    url: null,
  ),
  Data(
    img: 'https://www.abc.net.au/cm/rimage/11482044-3x2-xlarge.jpg?v=3',
    title: 'حديقة حيوان بيرث ',
    body:
        'تعد حديقة بيرث من مزارات السياحة في بيرث التي تشتهر بوجود العديد من حشائش السافانا  الي جانب العديد من الحيوانات المختلفة كالاسود و النمور و الكنغر الي جانب النباتات الجميلة و يمكن للسياح في هذه الحديقة التي علي طريقة عيش هذه الحيوانات المختلفة',
    url: null,
  ),
  Data(
    img: 'https://i.pinimg.com/originals/30/2c/be/302cbe6810274016b2f6207681e61504.jpg',
    title: 'شاطي كوتيسلو ',
    body:
        'يعد هذا الشاطئ من اشهر الشواطئ التي توجد في بيرث و يقصده العديد من السياح لممارسة  رياضة الغطس و ركوب الامواج و يتواجد بالشاطئ العديد من اماكن التنزه و تناول الطعام ',
    url: null,
  ),
  Data(
    img: 'https://tul.imgix.net/content/article/Perths_Best_Art_Galleries.jpg?auto=format,compress&w=1200&h=630&fit=crop',
    title: 'معرض الفنون',
    body:
        'يعد هذا المتحف من اشهر المعارض التي توجد في بيرث استراليا حيث يضم العديد من الاعمال  الفنية المختلفة لاشهر الفنانيين الاستراليين .',
    url: null,
  ),
];

var reasons = [
  Data(
    img: 'https://c1.wallpaperflare.com/preview/170/173/269/the-university-of-sydney-harry-potter.jpg',
    title: 'جودة التعليم ',
    body: 'تحتل استراليا الجميلة الترتيب التاسع على العالم في التعليم!.. مما يجعلها هدفاً للطلاب الباحثين عن العلم والمعرفة والحصول عليها بطريقة صحيحة .. لن تعطيك استراليا شهاد تزين بها غرفة حائطك فقط،ستزين بها عقلك وتبني بها حياتك! ',
    url: null,
  ),
  Data(
    img: 'https://c0.wallpaperflare.com/preview/642/977/92/australia-camperdown-the-university-of-sydney-tower.jpg',
    title: 'الجامعات المرموقة  ',
    body: 'مهما كان المجال التي تود دراسته او المجال الذي أنت شغوف به ، ستجد طلبك هنا .. تحتل الجامعات الاسترالية مركزا في ترتيب أفضل 50 جامعة في العالم في مجالات شتى مثل الاداب والعلوم الانسانسة والدراسات الطبية والهندسية والتكنولوجيةوالعلوم الحيوية والفيزياء والعلوم الاجتماعية.',
    url: null,
  ),
  Data(
    img: 'https://2.bp.blogspot.com/-J6fQ5mefzeo/TePVYbv9kNI/AAAAAAAAFJQ/gGQl-7SE2EQ/s1600/University+of+Melbourne+by+cool+images786+%25283%2529.jpg',
    title: 'المنح السخية',
    body: 'رغم التكلفة المتوسطة للدراسة في استراليا ، ولكن لا تقلق عزيزي! ف الحكومة الاسترالية تقدم منح دراسيا بقيمة 200 مليون دولار سنوياً! ',
    url: null,
  ),
  Data(
    img: 'https://www.flinders.edu.au/etc.clientlibs/flinders/clientlibs/clientlib-site/resources/images/flinders-university.png',
    title: 'التكنولوجيا ',
    body: 'رغم عراقة الجامعات الاسترالية وأصالتها الا أن هذا لم يمنعها من إعطاء التكنولوجيا والعلوم والابتكار اهتماماً خاصاً! حيث يتم استخدام أحدث الوسائل التكنولوجية لتكون العملية التعلمية على أكمل وجه. ',
    url: null,
  ),
  Data(
    img: 'https://i0.wp.com/cms.babbel.news/wp-content/uploads/2019/06/university.jpeg?h=9999&quality=100&w=993&fbclid=IwAR3OKyKh0dCyR1k_i4h_HedNq1EfZQe6qj03yQuewKW_p66n98-Y9b1qA_4',
    title: 'التنوع ',
    body: 'تقدم الجامعات الأسترالية الكثير من البرامج التعليمية في مختلف المجالات والتخصصات بتنسيقات متنوعة؛ فأستراليا بها 1100 مؤسسة تعليمية تُدرّس 22 ألف تخصص، فلن تحتار بين البرامج وستجد حتمًا ما يناسبك.',
    url: null,
  ),

];

var col = [
  Data(
    img: 'https://i.pinimg.com/originals/a3/35/e7/a335e7b8321121513332a301835fbf99.jpg',
    title: 'جامعة ملبورن ',
    body: 'أسست الجامعة في عام 1853، وترتيبها الأولى في أستراليا والـ 26 في العالم، وتقع في مدينة ملبورن ',
    url: null,
  ),
  Data(
    img: 'https://www.mynrma.com.au/-/media/business-motoring/sydney-uni-1140x500px.jpg?h=500&w=1140&hash=871949AE98E3D0AFDB9819086FF7CB31',
    title: 'جامعة سيدني ',
    body: 'أسست الجامعة في عام 1850، وهي أقدم جامعة في أستراليا، وترتيبها الثانية في أستراليا و31 في العالم، وتقع في مدينة سيدني',
    url: null,
  ),
  Data(
    img: 'https://i.ytimg.com/vi/QOkfCHkAdL8/maxresdefault.jpg',
    title: 'جامعة كوينزلاند استراليا ',
    body: 'أسست الجامعة في عام 1909، وترتيبها الثالث على أستراليا والـ 42 على مستوى العالم، وتقع في مدينة بريسبان في ولاية كوينزلاند ',
    url: null,
  ),
  Data(
    img: 'https://www.aurecongroup.com/-/media/images/aurecon/content/projects/property/monash-chancellery/monash-university-chancellery-outdoor1.jpg',
    title: 'جامعة موناش ',
    body: 'أُسست الجامعة في عام 1958، وترتيبها الرابع على أستراليا والـ 62 على مستوى العالم، وتقع في مدينة كلايتون في ولاية فكتوريا',
    url: null,
  ),
  Data(
    img: 'https://scholarship-positions.com/wp-content/uploads/2018/08/ANU-Master-of-Philosophy-Scholarship-for-Australian-and-International-Students-in-Australia-1024x558.jpg',
    title: 'جامعة أستراليا الوطنية ',
    body: 'أُسست الجامعة في عام 1946، وترتيبها الخامس على أستراليا والـ 66 على مستوى العالم، وتقع في العاصمة كانبيرا. ',
    url: null,
  ),
  Data(
    img: 'https://www.intostudy.com/images/ImagesUni/Newcastle%20University/University%20Detail/INTO-NCL-Armstrong-building-hero.jpg?w=1255&q=80',
    title: 'جامعة نيوكاسل أستراليا ',
    body: 'تأتي جامعة نيوكاسل في المرتبة الـ 207 عالمياً لتكون بذلك الجامعة رقم 10 ضمن قائمة أفضل الجامعات الأسترالية. وتُعتبر UNA من أصغر الجامعات الرائدة في أستراليا من حيث عدد الطلّاب، حيث يدرس على مقاعدها أكثر بقليل من 12 ألف طالب يُشكّل طلّاب الدراسات العليا 85% منهم',
    url: null,
  ),
  Data(
    img: 'https://images.adsttc.com/media/images/5d5c/2e2e/284d/d1cd/8300/018f/newsletter/02_N7A9067_UTS_Central_credit_Andy_Roberts_hr.jpg?1566322166',
    title: 'جامعة سدني التقنية ',
    body: 'واحدة من أفضل جامعات العالم في تخصصات مثل التمريض والفنون والمحاسبة والهندسة المعمارية وعلوم الحاسب والهندسة الكهربائية والإلكترونية، لتُصنّف بذلك بالمرتبة 140 على مستوى العالم ممّا يضعها ضمن جامعات النخبة في أستراليا ',
    url: null,
  ),
  Data(
    img: 'https://aramme.com/thumb/w920/uploads/images/2020/07/W5N5r.jpeg',
    title: 'جامعة أديلايد',
    body: 'مؤسسة بحثية تُقدّم مستوى أكاديمي عالي، وفي حين تُعتبر ثالث أقدم جامعة في أستراليا فهي دائماً ما تُصنّف ضمن أفضل 1% من الجامعات في العالم  من بين 21 ألف طالب يدرسون في جامعة أديلايد، تحتضن الجامعة أكثر من 8500 طالب أجنبي',
    url: null,
  ),
  Data(
    img: 'https://i2.wp.com/truescho.com/wp-content/uploads/2020/05/97.jpg?fit=1200%2C673&ssl=1',
    title: 'جامعة نيو ساوث ويلز ',
    body: ' في المرتبة الـ 43 عالمياً تأتي جامعة نيو ساوث ويلز  والتي تمتلك سمعة أكاديمية طيّبة تجعلها من الجامعات البحثية الرائدة على مستوى العالم. تأسّست الجامعة سنة 1949 وباتت اليوم موطناً لنحو 43 ألف طالب يُشكّل الطلّاب الدوليون نحو 40% منهم  .تحتل جامعة نيو ساوث ويلز سيدني المرتبة الـ 6 عالمياً في هندسة التعدين والـ 12 في تخصص الهندسة المدنية ',
    url: null,
  ),
  Data(
    img: 'https://augstudy.com/aug-website-files/wp-content/uploads/2019/10/news_group_of_eight_the_university_of_western_australia_650x400.jpg',
    title: 'جامعة استراليا الغربية ',
    body: 'تُوصف جامعة أستراليا الغربية بأنّها مُجتمع ديناميكي وتقدّمي من المحاضرين والباحثين والموظفين والطلّاب الذين يتطلّعون للتعلّم والابتكار والبحث. في 2020 تُصنّف الجامعة في المرتبة الـ 86 عالمياً لتكون بذلك في المركز السابع ضمن قائمة أفضل الجامعات الأسترالية في نحو 18 ألف طالب يبلغ عدد الطلّاب الدوليين نحو 8700 طالب ممّا يعكس صورة عن التنوّع الثقافي داخل الحرم الجامعي ',
    url: null,
  ),

];


var o1 =[
  Data(
    img: 'https://cdn.pixabay.com/photo/2016/06/10/17/47/desert-1448579_1280.jpg',
    title: 'التاريخ والثقافة ',
    body: 'لا يمكن للمرء تلخيص مصطلح "الثقافة الأسترالية" أو "المجتمع الأسترالي" في جملة أو فقرة واحدة. فبدءاً برقصة الهاكا الشهيرة ومروراً بمَعْلَم دار أوبرا سيدني ذات السمعة العالمية، تعد الثقافة الأسترالية بوتقة كاملة وغنية المتنوعة والفريدة والمختلفة.',
    url: null,
  ),
  Data(
    img: 'https://cropper.watch.aetnd.com/public-content-aetn.video.aetnd.com/video-thumbnails/AETN-History_VMS/21/206/tdih-jan26-HD.jpg?w=1440',
    title: 'كيف يمكن وصف الثقافة الأسترالية؟',
    body: 'لا تقلق عزيزي المسافر العربي ! .. ستكون محل ترحيب بك في استراليا .. لن نتشعر بالغربة او الوحدة هنا    فالثقافة الاسترالية نسيج غني بالتنوع الدائم ! فمن الموسيقى إلى عادات الطهي، يمكنك بوضوح رؤية التنوع والاندماج الثقافي ، ستجد العديد من الطاعم التي تقدم مختلف الاطعمة الخاصة في ثقافات عدة ! هذه البصمة الثقافية الرحبة تجعل من السهل على أستراليا استيعابك واستيعاب جميع القادمين اليها ذن لا تقلق عزيزي ! مرحب بك دائما في استراليا  ',
    url: null,
  ),

  Data(
    img: 'https://www.tripsavvy.com/thmb/yGvdjtyQ1VSGoppiUdYN4d8zsSw=/2252x1267/smart/filters:no_upscale()/GettyImages-693631434-5b3a3e3dc9e77c001ad2fed8.jpg',
    title: 'من هم الأستراليون الأوائل؟',
    body: 'لنبدأ رحلتنا معاً بالشعوب الأولى التي كانت أول من استقر بهذه القارة النائية بأطراف العالم منذ حوالي 65,000 عام. وتعرف هذه الشعوب باسم الأستراليين الأوائل أو الأستراليين الأصليين، وهم في مجملهم قبائل متنوعة يتشاركون في أصل عرقي واحد. وبالإضافة لتلك الشعوب الأسترالية الأصيلة يتم إطلاق المسمى ذاته على سكان جزر مضيق توريس في شمال أستراليا',
    url: null,
  ),

  Data(
    img: 'https://lh3.googleusercontent.com/proxy/MGtW7cqj5CKoMwGVx_ki1j_LEn7A7s-490cnG75Gc6Mtqx8UPI8uvw-tx0gSB9bLO8kPD0rG-zpy0NDPxdcP8rS3W0RZjelAtmGdzzqI',
    title: 'كيف تبدو الحياة الحضرية بمدن أستراليا؟',
    body: 'مثل أي بلد متقدم، تتمتع المدن الأسترالية بحياة حضرية ومدنية مزدهرة، حيث يحتوي البلد على 90 مدينة، منها خمس أكبر المدن الأسترالية ومواطن الفن والثقافة بالبلاد. وتستضيف هذه المدن العديد من الأحداث والفعاليات الرياضية والترفيهية والفنية والثقافية العالمية التي تجذب الزوار من شتى بقاع الأرض. ويسعدنا إعلامك بأن نمط الحياة بهذه المدن الأسترالية مثير للإعجاب مثل أي مدن كبرى أخرى بدول العالم المتقدم  ونظراً لاعتدال مناخ أستراليا نسبياً حيث يتراوح بين المتوسط والدافئ، فإن جميع المقاهي بلا استثناء تقريباً توفر لك مناطق مفتوحة للجلوس في الهواء الطلق والاستمتاع بالطبيعة الساحرة..',
    url: null,
  ),

  Data(
    img: 'https://www.mexatk.com/wp-content/uploads/2016/11/%D8%B5%D9%88%D8%B1-%D8%B9%D9%84%D9%85-%D8%A7%D8%B3%D8%AA%D8%B1%D8%A7%D9%84%D9%8A%D8%A7-2-1.jpg?fbclid=IwAR325gktFccTrsvpCIG12gU1Hfar53nrQ06i7Ym-8qpEvlcvR4lBHZPw0bw',
    title: 'كيف تتأقلم مع العادات الاجتماعية الأسترالية؟',
    body: 'على الرغم من عدم واقعية أو مصداقية تعميم نمط اجتماعي واحد ومحدد على دولة كاملة خاصة عندما تكون بهذه الضخامة وهذا التنوع العرقي والثقافي، لا يزال هناك بعض العناصر الثقافية الشائعة داخل المجتمع الأسترالي الحضري بالمدن والتي يجب أن تكون على دراية بها. ومعرفة تلك العناصر الهامة مسبقاً ستجعل تعاملاتك الاجتماعية كطالب دولي مع الناس هناك أكثر راحة وأقل حرجاً',
    url: null,
  ),

  Data(
    img: 'https://images2.alphacoders.com/815/815428.jpg',
    title: 'اقتصاد استراليا ',
    body: 'تنعم استراليا بوفرة في الموارد الطبيعية وتعتبر مدينة ثرية جدًا في أنها تسمى غالبًا بالبلد المحظوظ. وتفخر هذه الدولة عالية التقدم بالمركز الثاني عشر من حيث أعلى اقتصاد في العالم. وتزخر استراليا التي تقع في المنطقة الجنوبية للمحيط الهادي بخامس أكبر دخل لكل فرد في العالم (66,984 دولار). ومع معدل البطالة الذي تحسد عليه استراليا، تصنف استراليا بدرجة عالية في الكثير من المقارنات الدولية، مثل: جودة الحياة، الصحة، التعليم، الحرية الاقتصادية وحماية الحريات المدنية والحقوق السياسية. بينما تكافح أغلب الاقتصاديات المتطورة العالمية للتعامل مع الأزمة المالية العالمية، فقد تعاملت استراليا من خلال حفظ اقتصادها في مسار صاعد. تستمر استراليا التي تقع بشكل محير بالقرب من بعض اقتصاديات العالم النامية بسرعة- في التمتع بالنمو في إجمالي الناتج المحلي. معدل البطالة منخفض فيها وكذا معدلات الفوائد (منخفضة للغاية). تقع الدولة الواقعة جنوب الهادي بين القليل من الدول المتقدمة التي تتمتع بتصنيف AAA من جميع وكالات التصنيف الدولية. وقد تنبأ صندوق النقد الدولي في عام 2012 أن استراليا سوف تصبح أفضل اقتصاد متقدم في الأداء في العالم على مدار السنتين القادمتين. ووفقًا لتقرير الثروة العالمية لكريديت سويس لعام 2011، فإن استراليا امتلكت ثروة متوسطة تقدر بـ 222,000 دولار أمريكي (217,559 دولار)، الأعلى في العالم وتقريبًا أربع مرات من مبلغ كل فرد بالغ أمريكي',
    url: null,
  ),
  Data(
    img: 'https://wallpapercave.com/wp/wp2780647.jpg',
    title: 'العلم في استراليا ',
    body: 'لطالما كان هناك فضل كبير لاستراليا والعلماء الاسترالين على العالم فاكتشافات واختراعات عديدة . ولا عجب ولا استغراب من هذه الدولة العريقة اخراج قامات علمية ففي كل مجالات العلم كان لاستراليا وعلمائها بصمتهم المناخ وعلم الادوية والطب والهندسة والجولوجيا والعلوم والاثار والحاسوب والخ ',
    url: null,
  ),



];

var o2 =[
  Data(
    img: 'https://rotana.net/assets/uploads/2016/01/Untitled-1234.jpg',
    title: 'كرة القدم الاسترالية',
    body: 'كرة القدم الأسترالية لعبة شتوية محبوبة إلى حد بعيد في ولايات أستراليا الجنوبية. وقد اخترعها الأستراليون، وتُلعب في أستراليا وبابوا غينيا الجديدة فقط ويتكون فريق كرة القدم الأسترالية من 18 لاعبًا، ولاعبين احتياطيين يمكن إشراكهما في اللعب بدلاً من لاعبين آخرين في الميدان في أي وقت يصاب فيه لاعب ويُحتاج فيه إلى اللاعب البديل  كيف تلعب كرة القدم الأسترالية;  تستغرق لعبة كرة القدم الأسترالية 100 دقيقة في المباراة الواحدة، على أن يقسم هذا الزمن إلى أربعة أرباع متساوية. وهذا الوقت لا يتضمن فترات الراحة بين الأرباع ولا الوقت الإضافي الذي يحدث عندما تكون الكرة خارج الملعب، أو بعد تسجيل هدف ',
    url: null,
  ),
  Data(
    img: 'https://wallpaperaccess.com/full/1088580.jpg',
    title: 'الكركت ',
    body: 'الكريكيت رياضة جماعية يشارك فيها فريقان مكون كل منهما من أحد عشر لاعبًا، تضرب فيها كرة بحجم قبضة اليد من قبل لاعب يدعى رامي الكرة، أما اللاعب الخصم فيدعى رجل المضرب، ويحاول صد الكرة باستخدام مضرب نحيف شبيه بالمجذاف ، ويتركز الانتباه أساسًا حول علامتين تشكلان الأهداف تدعيان ويكيت، وهما مجموعة من ثلاث عصي متصلة، ويحاول رامي الكرة إصابتها لكي يوقع قطعتين خشبيتين اثنتين منهما مثبتتين على الجذوع. المنتخب الاسترالي للكريكيت : تعد لعبة الكركيت لعبة مشهورة في استراليا ويعد المنتخب الوطني واحد من اقوى منتخبات العالم في هذه اللبعة حيث فاز في كاس العالم 5 مرات !  ',
    url: null,
  ),
  Data(
    img: 'https://wallpaperaccess.com/full/780473.jpg',
    title: 'لتنس',
    body: 'من أشهر البطولات للتنس في العالم هي بطولة استراليا المفتوحة للتنس !  تُقام البطولة سنوياً في آخر أسبوعين من شهر يناير في مدينة ملبورن .. تتضمن بطولة أستراليا المفتوحة مسابقات فردي الرجال، وفردي السيدات، وزوجي الرجال، وزوجي السيدات، والزوجي المختلط، والمبتدئين الشباب، وذوي الاحتياجات الخاصة، والأساطير .. تمتاز بطولة أستراليا بثاني أعلى جمهور ببطولات التنس ..',
    url: null,
  ),

];


// Data(
// img: null,
// title: null,
// body: null,
// url: null,
// ),

class SCat extends StatelessWidget {
  SCat({@required this.lc, @required this.r});
  final String lc;
  final String r;

  @override
  Widget build(BuildContext context) {
   var c=[];
    if (lc == '1'){c = countries;}
    if (lc == '2'){c = reasons;}
   if (lc == '3'){c = o1;}


    var screenSize = MediaQuery.of(context).size;
    var width = screenSize.width;
    var height = screenSize.height;
    return CarouselSlider.builder(
      options: CarouselOptions(
        height: width / 2.25,
        viewportFraction: 0.8,
        aspectRatio: 16 / 9,
        initialPage: 0,
        autoPlayInterval: Duration(seconds: 6),
        enlargeCenterPage: true,
        scrollDirection: Axis.horizontal,
        autoPlay: true,
        enableInfiniteScroll: true,
      ),
      itemCount: c.length,
      itemBuilder: (BuildContext context, int i) => GestureDetector(
        onTap: () {
          Navigator.pushNamed(context, r, arguments: {
            'img': c[i].img,
            'title': c[i].title,
            'body': c[i].body,
            'id': c[i].id,
          });
        },
        child: Container(
          decoration: BoxDecoration(
              borderRadius: BorderRadius.circular(12.0),
              image: DecorationImage(
                image: NetworkImage(c[i].img),
                fit: BoxFit.cover,
              )),
          child: Padding(
            padding: const EdgeInsets.all(8.0),
            child: Center(
              child: Text(
                c[i].title,
                textDirection: TextDirection.rtl,
                style: TextStyle(
                  color: Colors.white,
                  fontSize: width / 14,
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }
}

class LCat extends StatefulWidget {
  LCat({@required this.lc, @required this.r});
  final String lc;
  final String r;

  @override
  _LCatState createState() => _LCatState();
}

class _LCatState extends State<LCat> {
  @override
  Widget build(BuildContext context) {
    var c = [];
    if (widget.lc == '11') {
      setState(() {
        c = syd;
      });
    }
    if (widget.lc == '12') {
      setState(() {
        c = mel;
      });
    }
    if (widget.lc == '13') {
      setState(() {
        c = bre;
      });
    }
    if (widget.lc == '14') {
      setState(() {
        c = berth;
      });
    }
    if (widget.lc == '2') {
      setState(() {
        c = col;
      });
    }
    if (widget.lc == '3') {
      setState(() {
        c = o2;
      });
    }

    var screenSize = MediaQuery.of(context).size;
    var width = screenSize.width;
    return CarouselSlider.builder(
      options: CarouselOptions(
        height: width / 2.3,
        viewportFraction: 0.8,
        aspectRatio: 16 / 9,
        initialPage: 0,
        autoPlayInterval: Duration(seconds: 6),
        enlargeCenterPage: true,
        scrollDirection: Axis.horizontal,
        autoPlay: true,
        enableInfiniteScroll: true,
      ),
      itemCount: c.length,
      itemBuilder: (BuildContext context, int i) => GestureDetector(
        onTap: () {
          Navigator.pushNamed(context, widget.r, arguments: {
            'img': c[i].img,
            'title': c[i].title,
            'body': c[i].body,
            'url': c[i].url
          });
        },
        child: Container(
          decoration: BoxDecoration(
              borderRadius: BorderRadius.circular(12.0),
              image: DecorationImage(
                image: NetworkImage(c[i].img),
                fit: BoxFit.cover,
              )),
          child: Padding(
            padding: const EdgeInsets.all(8.0),
            child: Column(
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
                Text(
                  c[i].title,
                  textDirection: TextDirection.rtl,
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: width / 22,
                  ),
                ),
                SizedBox(
                  height: width / 20,
                ),
                Text(
                  c[i].body,
                  textDirection: TextDirection.rtl,
                  overflow: TextOverflow.ellipsis,
                  textAlign: TextAlign.justify,
                  maxLines: 2,
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: width / 30,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
